 The dropna() function in pandas is used to remove missing or null values from a DataFrame or Series

 dropna() removes rows that contain any missing values (null values) in a DataFrame.

In [62]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [40]:
df.dropna()

     0    1    2
1  2.0  3.0  5.0

When a DataFrame contains `NaN` values, pandas converts the data type of the columns to float if the column originally contained integers. This is because `NaN` is a floating-point representation and cannot be stored in integer columns.

In [42]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

### advanced parameters

1 . `how` parameter
* `any` - Drop row or column if any values is null
* `all` - Drop rows or columns if all values are null

In [38]:
df.dropna(how='all')

     0    1    2
0  1.0  NaN  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [44]:
df.dropna(how='any')

     0    1    2
1  2.0  3.0  5.0

In [96]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [117]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])

df[4] = np.nan
df = df.drop(columns=[4])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [123]:
df.dropna(axis='rows', thresh=3)

     0    1  2
1  2.0  3.0  5

In [125]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [129]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [143]:
data.ffill()

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [145]:
data.bfill()

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [141]:
data.fillna(method='ffill')

C:\Users\winsa\AppData\Local\Temp\ipykernel_5360\1844443866.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [147]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [155]:
df.fillna(method='bfill', axis=1)

C:\Users\winsa\AppData\Local\Temp\ipykernel_5360\1498511816.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill', axis=1)

     0    1    2
0  1.0  2.0  2.0
1  2.0  3.0  5.0
2  4.0  4.0  6.0